# Использование базового образа с Java. Выберите версию JDK, соответствующую вашему приложению.
FROM openjdk:17

# Опционально: установка аргументов сборки для дополнительной настройки
# ARG SOME_BUILD_ARG

# Указание рабочей директории внутри контейнера
WORKDIR /app

# Копирование файлов сборки .jar из вашей целевой директории в контейнер
COPY target/*.jar app.jar

# Открытие порта, который использует ваше приложение
EXPOSE 8080

# Команда для запуска вашего приложения
ENTRYPOINT ["java","-jar","app.jar"]
